:PROPERTIES:
:ID:       5b31de71-5b6a-485f-aaff-aa2084731d6f
:END:
#+TITLE:     Lab Template
# +SUBTITLE:  Subtitle
#+AUTHOR:    David Conner
#+EMAIL:     dconner0011@email.vccs.edu

#+OPTIONS: author:t c:nil d:(not "LOGBOOK") date:t
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t todo:t |:t
#+OPTIONS: toc:nil

#+OPTIONS: creator:t
#+DESCRIPTION: notes

#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en

#+PROPERTY: header-args :eval never-expor

# #+OPTIONS: texht:t
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]

#+LATEX_HEADER_EXTRA: \usepackage{lmodern}
# #+LATEX_HEADER_EXTRA: \usepackage{rotfloat}
#+LATEX_HEADER: \hypersetup{colorlinks=true, linkcolor=blue}
#+LATEX_HEADER_EXTRA: \usepackage{units}
#+LATEX_HEADER_EXTRA: \usepackage{comment}
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}
#+LATEX_HEADER_EXTRA: \usepackage{tabu,longtable}
#+LATEX_HEADER_EXTRA: \usepackage[table]{xcolor}
#+LATEX_HEADER_EXTRA: \usepackage{booktabs}
#+LATEX_HEADER_EXTRA: \usepackage{makeidx}
#+LATEX_HEADER_EXTRA: \makeindex
#+LATEX_HEADER_EXTRA: \usepackage{epstopdf}
#+LATEX_HEADER_EXTRA: \epstopdfDeclareGraphicsRule{.gif}{png}{.png}{convert #1 \OutputFile}
#+LATEX_HEADER_EXTRA: \AppendGraphicsExtensions{.gif}


#+BEGIN_EXPORT LaTeX
\DeclareRobustCommand{\myindex}[1]{#1\index{#1}}
#+END_EXPORT

# For export to ODT (the file is not optimized for this)
# #+OPTIONS: LaTeX:t
# #+OPTIONS: tex:imagemagick
# #+OPTIONS: tex:dvipng

# Coversheet
# Needs to be at top level or needs another workaround

#+begin_export latex
\thispagestyle{empty}% empty header/footer
{

\begin{center}\strut
\bfseries\Huge
Lab Template
\end{center}
\vfill

\centerline{My name}
\vfill

\begin{center}\strut
A report submitted \\
to University \ldots \\
So and So
\end{center}
\vfill

\begin{center}\strut
Copyrights \\
This copy of \\
the report supplied...
\end{center}
\clearpage

}
#+end_export


* Objective

Aligned to the left.

* Data, Analysis & Results

A table generated by python

# +begin_src python :results table :colnames "a,b,c"
#+name: gen-table
#+begin_src python :results table
return [[i,10-i,i*(10-i)] for i in range(1,10)] #./
  #insert(0,[]) #colnames
#+end_src

#+RESULTS:
| 1 | 9 |  9 |
| 2 | 8 | 16 |
| 3 | 7 | 21 |
| 4 | 6 | 24 |
| 5 | 5 | 25 |
| 6 | 4 | 24 |
| 7 | 3 | 21 |
| 8 | 2 | 16 |
| 9 | 1 |  9 |

#+name: gen-table-avg
#+begin_src python :eval noexport :var t_rows=gen-table :results value
return sum([sum(r) for r in t_rows])/len(t_rows)
#+end_src

#+RESULTS: gen-table-avg
: 28.333333333333332

A horizontal line.

--------

Some more data in a table

| Trial                            |     1 |     2 |     3 |     4 |     5 |
|----------------------------------+-------+-------+-------+-------+-------|
| Run #                            |     6 |     2 |     3 |     4 |     5 |
|----------------------------------+-------+-------+-------+-------+-------|
| First Region =g= $(\frac{m}{s^{2}})$  | 16.74 | 17.14 | 17.18 |  9.84 | 17.34 |
| Second Region =g= $(\frac{m}{s^{2}})$ | 16.74 | 16.70 | 16.72 | 16.72 |  9.88 |

Here's a named table with a caption:

#+CAPTION: some data with a caption
| Trial                            | 1 | 2 | 3 | 4 | 5 |
|----------------------------------+---+---+---+---+---|
| Run #                            | 6 | 2 | 3 | 4 | 5 |
|----------------------------------+---+---+---+---+---|
| First Region =g= $(\frac{m}{s^{2}})$  |   |   |   |   |   |
| Second Region =g= $(\frac{m}{s^{2}})$ |   |   |   |   |   |

* Conclusion
